{
    "HomePage": {
        "title": "Welcome to my profile",
        "introduction": "I am currently a third-year student at <link>Centrale Lyon</link>. I am particularly enthusiast about web development and also interested in many topics around computer science: cybersecurity, data analysis, data visualization...",
        "study": "My Studies",
        "tools": "Toolbox: ",
        "project": "Projects",
        "desc-projects": "Here are some projects carried out during my studies and in my free time.",
        "projects-link": "Related {count, plural, =1 {Project} other {Projects}}: ",
        "other-languages": "Other languages used: ",
        "commanditaire": "Client: ",
        "languages": "{count, plural, =1 {Language} other {Languages}} used: ",
        "see-more": "See more information",
        "some-lessons": "Some courses taken:",
        "visit-website": "Visit {count, plural, =1 {the website} other {the websites}} : ",
        "no-study-found": "No study found.",
        "no-study-found-desc": "No study has taught me this language. Please check <link>projects</link> to see those related to this language.",
        "centrale": {
            "title": "General Engineering Program",
            "description": "Comprehensive engineering education covering various fields such as computer science, mathematics, physics, and project management.",
            "lessons": {
                "Visualisation": {
                    "name": "Data Visualization",
                    "description": "Study of data visualization techniques, tools and best practices to effectively communicate information through graphical and interactive representations."
                },
                "Database": {
                    "name": "Relational Databases",
                    "description": "Introduction to relational database concepts, SQL language, database design and optimization techniques."
                },
                "DataScience": {
                    "name": "Data Science",
                    "description": "Introduction to data science concepts : data analysis, machine learning, and statistical modeling using Python."
                },
                "WebApps": {
                    "name": "Web Development",
                    "description": "Learning the fundamental concepts of web development, including HTML, CSS, JavaScript, and client-server relationships."
                },
                "CppGui": {
                    "name": "C++ & Qt for GUI Development",
                    "description": "Introduction to C++ programming and the Qt framework for developing graphical user interfaces."
                },
                "IA-introduction": {
                    "name": "Introduction to Artificial Intelligence",
                    "description": "Overview of artificial intelligence concepts, including machine learning, neural networks, and natural language processing."
                },
                "reseaux": {
                    "name": "Computer Networks",
                    "description": "Study of the principles of the 7 layers of the OSI standard, network protocols, and machine-to-machine communication."
                },
                "cybersecu": {
                    "name": "Cybersecurity",
                    "description": "Introduction to cybersecurity principles, including threat analysis, risk management, and security protocols with a general overview of the different types of attacks and defenses tools."
                },
                "BigData": {
                    "name": "Big Data",
                    "description": "Study of Big Data technologies and tools for processing large volumes of data."
                }
            }
        },
        "univ": {
            "title": "Master's Degree in Information and Web Technologies",
            "description": "Data science-focused program covering data visualization, Big Data, and data analysis techniques.",
            "lessons": {
                "DataAnalysis": {
                    "name": "Data Analysis",
                    "description": "Processing complex datasets to analyze and visualize while minimizing biases and data loss. Creation of an interactive user interface to visualize and analyze a large dataset."
                },
                "BigData": {
                    "name": "Big Data",
                    "description": "Study of Big Data technologies, from distributed data storage to processing frameworks like Hadoop and Spark with some works on stream processing of live data streams."
                }
            }
        },
        "fermat": {
            "title": "Preparatory class for high schools",
            "description": "Intensive two-year program preparing students for entrance exams to French engineering schools, focusing on mathematics, physics, and computer science.",
            "lessons": {
                "info": {
                    "name": "Computer Science",
                    "description": "Introduction to programming concepts as algorithms and problem-solving techniques."
                },
                "math": {
                    "name": "Mathematics",
                    "description": "Advanced study of mathematical concepts including calculus, algebra, and geometry."
                },
                "phy": {
                    "name": "Physics",
                    "description": "In-depth study of physics concepts : mechanics, electricity, optics, quantum mechanics, chemistry..."
                }
            }
        },
        "projectsContent": {
            "stage-application": {
                "description": "Développement d'une application web pour la collecte de données sportives via le traitement d'images et vidéo à des fins de recherche."
            },
            "jeu-inclusif": {
                "description": "Développement d'un jeu sérieux visant à sensibiliser les équipes de développement d'interfaces utilisateur autour de l'inclusivité numérique lors de la création, du développement et de la gestion de leurs projets informatiques",
                "paragraph": {
                    "text": "Le projet a été fait dans une équipe de 7 personnes avec une gestion de projet utilisant la méthodologies Scrum. Lors de celui-ci, nous avons appris à utiliser Angular et Figma pour créer des maquettes de l'interface utilisateur. Le projet a été découpé en trois parties :",
                    "li": [
                        "la mise en ligne d'un jeu de société sérieux ;",
                        "un quiz d'inclusivité pour tester ses connaissances dans le domaine ;",
                        "un formulaire d'auto-évaluation d'inclusivité pour vérifier qu'un projet inclut bien dans toutes ses étapes les concepts d'inclusivité numérique."
                    ]
                }
            },
            "challenger": {
                "description": "Développement de la gestion de permanences pour gérer les bénévoles afinde mettre en place l'un des plus grands événements sportifs étudiants de France."
            },
            "miss-hestia": {
                "description": "Mise en place d'un site vitrine pour mettre en avant les oeuvres d'art d'une artiste"
            },
            "conference": {
                "description": "Application web permettant la gestion d'une base (factices) de données de conférences. Le but du projet étant de mettre en place une base de données optimisée, puis de faire des requêtes SQL optimisées pour enfin avoir une interface utilisature simple pour visualiser les données."
            },
            "data-dash": {
                "description": "interface utilisateur interactive pour visualiser et analyser un grand ensemble de données (ici Covid)."
            },
            "moteur-recherche": {
                "description": "Développement d'un moteur de recherche simple en Python en utilisant des techniques de traitement du langage naturel pour rechercher des documents textuels dans une base de données d'études qui nous a été donnée. Ajout d'une solution à partir de graphe de relation entre les documents par les citations effectuées."
            },
            "jeu-dame": {
                "description": "Mise en place d'un jeu de dames en interface web pour apprendre les bases du développement web en JavaScript et la gestion des sockets."
            },
            "2048-qt": {
                "description": "Développement d'un 2048 en C++ avec une interface graphique en utilisant la bibliothèque Qt. Il y a de nombreuses fonctionnalités supplémentaires donc une tentative de création d'un suika."
            },
            "useful-components": {
                "description": "Bibliothèques de composants React simple et réutilisables pour apprendre à la fois le framework React et la création de composants élémentaires."
            },
            "profile": {
                "description": "Création d'un site web pour faire part de mon profil et de mes projets réalisés. C'est le site web sur lequel vous êtes actuellement."
            }
        }
    },
    "Metadata": {
        "title": "Quentin Potiron - My Profile",
        "siteName": "My Profile",
        "description": "Website serving as a portfolio",
        "keywords": "Portfolio, Profile, Web Development, Data Analysis, Computer Science",
        "locale": "en_US"
    },
    "Bar": {
        "alt-profile-picture": "Profile picture",
        "student": "Student "
    },
    "NotFound": {
        "title": "Page Not Found",
        "description": "Sorry, the page you are looking for does not exist or has been moved.",
        "back-home": "Back to Home"
    },
    "ErrorPage": {
        "title": "Oops! An error occurred",
        "description": "There seems to be a problem with your request.",
        "retry": "Retry",
        "back-to-home": "Back to Home"
    },
    "DefaultTexts": {
        "selectAnOption": "Select an option",
        "select": "Select one or more programming languages",
        "search": "Search...",
        "all": "All",
        "clear": "Clear",
        "close": "Close",
        "more": "more",
        "clear-all": "Clear all selections",
        "aria-search": "Search through available options",
        "dropdown-explain": "Multi-select dropdown. Use arrow keys to navigate, spacebar to select or deselect an option, and escape key to close the dropdown.",
        "filter-explain": "Type to filter options. Use arrow keys to navigate through filtered options."
    },
    "Footer": {
        "copyright": "© 2026 My Profile. All rights reserved.",
        "contact-me": "Contact : "
    },
    "Header": {
        "home": "Home",
        "study": "Studies",
        "project": "Projects",
        "alt-logo": "Site logo"
    },
    "StudyPage": {
        "title": "My Studies"
    },
    "ProjectPage": {
        "title": "My Projects",
        "introduction": "You will find below the list of my completed or ongoing projects. Some projects are carried out as part of my studies, others have been done purely by passion. Moreover, the projects are divided between short and complete ones.",
        "large-projects": "Major Projects",
        "little-projects": "Other Projects",
        "no-project-found": "No project found.",
        "no-project-found-desc": "This language or tool has not been used in any of these projects."
    },
    "ThemeSwitch": {
        "switch": "Switch theme"
    }
}
