{
    "HomePage": {
        "title": "Welcome to my profile",
        "introduction": "I am currently a third-year student at <link>Centrale Lyon</link>. I am particularly enthusiast about web development and also interested in many topics around computer science: cybersecurity, data analysis, data visualization...",
        "study": "My Studies",
        "tools": "Toolbox: ",
        "project": "Projects",
        "desc-projects": "Here are some projects carried out during my studies and in my free time.",
        "projects-link": "Related {count, plural, =1 {Project} other {Projects}}: ",
        "other-languages": "Other languages used: ",
        "commanditaire": "Client: ",
        "languages": "{count, plural, =1 {Language} other {Languages}} used: ",
        "see-more": "See more information",
        "some-lessons": "Some courses taken:",
        "visit-website": "Visit {count, plural, =1 {the website} other {the websites}} : ",
        "no-study-found": "No study found.",
        "no-study-found-desc": "No study has taught me this language. Please check <link>projects</link> to see those related to this language.",
        "link-study": "Link to my studies",
        "link-project": "Link to my projects",
        "link_lesson": "Link to the course",
        "creators": "{count, plural, =1 {Co-author} other {Co-authors}}: ",
        "centrale": {
            "title": "General Engineering Program",
            "description": "Comprehensive engineering education covering various fields such as computer science, mathematics, physics, and project management.",
            "lessons": {
                "Visualisation": {
                    "name": "Data Visualization",
                    "description": "Study of data visualization techniques, tools and best practices to effectively communicate information through graphical and interactive representations."
                },
                "Database": {
                    "name": "Relational Databases",
                    "description": "Introduction to relational database concepts, SQL language, database design and optimization techniques."
                },
                "DataScience": {
                    "name": "Data Science",
                    "description": "Introduction to data science concepts : data analysis, machine learning, and statistical modeling using Python."
                },
                "WebApps": {
                    "name": "Web Development",
                    "description": "Learning the fundamental concepts of web development, including HTML, CSS, JavaScript, and client-server relationships."
                },
                "CppGui": {
                    "name": "C++ & Qt for GUI Development",
                    "description": "Introduction to C++ programming and the Qt framework for developing graphical user interfaces."
                },
                "IA-introduction": {
                    "name": "Introduction to Artificial Intelligence",
                    "description": "Overview of artificial intelligence concepts, including machine learning, neural networks, and natural language processing."
                },
                "reseaux": {
                    "name": "Computer Networks",
                    "description": "Study of the principles of the 7 layers of the OSI standard, network protocols, and machine-to-machine communication."
                },
                "cybersecu": {
                    "name": "Cybersecurity",
                    "description": "Introduction to cybersecurity principles, including threat analysis, risk management, and security protocols with a general overview of the different types of attacks and defenses tools."
                },
                "BigData": {
                    "name": "Big Data",
                    "description": "Study of Big Data technologies and tools for processing large volumes of data."
                }
            }
        },
        "univ": {
            "title": "Master's Degree in Information and Web Technologies",
            "description": "Data science-focused program covering data visualization, Big Data, and data analysis techniques.",
            "lessons": {
                "DataAnalysis": {
                    "name": "Data Analysis",
                    "description": "Processing complex datasets to analyze and visualize while minimizing biases and data loss. Creation of an interactive user interface to visualize and analyze a large dataset."
                },
                "BigData": {
                    "name": "Big Data",
                    "description": "Study of Big Data technologies, from distributed data storage to processing frameworks like Hadoop and Spark with some works on stream processing of live data streams."
                }
            }
        },
        "fermat": {
            "title": "Preparatory class for high schools",
            "description": "Intensive two-year program preparing students for entrance exams to French engineering schools, focusing on mathematics, physics, and computer science.",
            "lessons": {
                "info": {
                    "name": "Computer Science",
                    "description": "Introduction to programming concepts as algorithms and problem-solving techniques."
                },
                "math": {
                    "name": "Mathematics",
                    "description": "Advanced study of mathematical concepts including calculus, algebra, and geometry."
                },
                "phy": {
                    "name": "Physics",
                    "description": "In-depth study of physics concepts : mechanics, electricity, optics, quantum mechanics, chemistry..."
                }
            }
        },
        "projectsContent": {
            "stage-application": {
                "name": "Web Application for Sports Data Collection",
                "description": "Web application development for collecting sports data with image and video processing for research purposes"
            },
            "jeu-inclusif": {
                "name": "Inclusif : le jeu",
                "description": "Development of a serious game into a web application to raise awareness about digital inclusion among web project during the creation, development and management process.",
                "paragraph": {
                    "text": "This project was made in a group of seven people during a study project of a year. We learned to use Agile methodologies to manage the project and we used Figma to visualize the UI and Angular with HTML and CSS to actually make it. The project includes three main parts:",
                    "li": [
                        "the serious game itself where the player has to make choices to create an inclusive web project ;",
                        "a questionnaire to evaluates the player's knowledge about digital inclusion ;",
                        "a self-assessment form to help the player evaluate their own web projects regarding digital inclusion."
                    ]
                }
            },
            "challenger": {
                "name": "Challenger",
                "description": "Design and development of a part of a web application to manage a student association's activities for the preparation and organization of the annual event."
            },
            "miss-hestia": {
                "name": "Showcase Website - Miss Hestia",
                "description": "Development of a showcase website to highlight an artist's artworks."
            },
            "conference": {
                "name": "Conference Database Management",
                "description": "Development of a web application to manage a false conference database. The purpose of the project is to optimize the database design, then to optimize SQL queries to finally create a simple user-friendly interface."
            },
            "data-dash": {
                "name": "Covid Data Visualization",
                "description": "Interactive user interface to visualize and analyze a large dataset."
            },
            "moteur-recherche": {
                "name": "Search Engine",
                "description": "Development of a simple search engine using natural language processing techniques. Furthermore, there is the implementation of a graph-based solution by taking into account the citations between documents."
            },
            "jeu-dame": {
                "name": "Web Draughts Game",
                "description": "Implementation of a web-based draughts game to learn the basics of web development, JavaScript, and the concept of sockets."
            },
            "2048-qt": {
                "name": "2048",
                "description": "Realization of a 2048 in C++ using Qt GUI. Many additional features were added including an attempt to create a suika."
            },
            "useful-components": {
                "name": "Useful Components",
                "description": "Simple and reusable React component libraries to learn both the React framework and the creation of basic components."
            },
            "profile": {
                "name": "Portfolio Personnel",
                "description": "Realization of a portfolio website to share my profile and many of my projects done. This is the website you are currently on."
            }
        }
    },
    "Metadata": {
        "title": "Quentin Potiron - My Profile",
        "siteName": "My Profile",
        "description": "Website serving as a portfolio",
        "keywords": "Portfolio, Profile, Web Development, Data Analysis, Computer Science",
        "locale": "en_US",
        "projects-page-title": "Projects",
        "study-page-title": "Studies",
        "projects-page-desc": "Discover my projects carried out during my studies or for leisure",
        "study-page-desc": "Discover my studies and the courses I have taken"
    },
    "Bar": {
        "alt-profile-picture": "Profile picture",
        "student": "Student "
    },
    "NotFound": {
        "title": "Page Not Found",
        "description": "Sorry, the page you are looking for does not exist or has been moved.",
        "back-home": "Back to Home"
    },
    "ErrorPage": {
        "title": "Oops! An error occurred",
        "description": "There seems to be a problem with your request.",
        "retry": "Retry",
        "back-to-home": "Back to Home"
    },
    "DefaultTexts": {
        "selectAnOption": "Select an option",
        "select": "Select one or more programming languages",
        "search": "Search...",
        "all": "All",
        "clear": "Clear",
        "close": "Close",
        "more": "more",
        "clear-all": "Clear all selections",
        "aria-search": "Search through available options",
        "dropdown-explain": "Multi-select dropdown. Use arrow keys to navigate, spacebar to select or deselect an option, and escape key to close the dropdown.",
        "filter-explain": "Type to filter options. Use arrow keys to navigate through filtered options."
    },
    "Footer": {
        "copyright": "© 2026 My Profile. All rights reserved.",
        "contact-me": "Contact : "
    },
    "Header": {
        "home": "Home",
        "study": "Studies",
        "project": "Projects",
        "alt-logo": "Site logo"
    },
    "StudyPage": {
        "title": "My Studies"
    },
    "ProjectPage": {
        "title": "My Projects",
        "order-by": "Order by: ",
        "default": "Default",
        "date": "Date",
        "lexicographical": "Lexicographical",
        "introduction": "You will find below the list of my completed or ongoing projects. Some projects are carried out as part of my studies, others have been done purely by passion. Moreover, the projects are divided between short and complete ones.",
        "large-projects": "Major Projects",
        "little-projects": "Other Projects",
        "no-project-found": "No project found.",
        "no-project-found-desc": "This language or tool has not been used in any of these projects."
    },
    "ThemeSwitch": {
        "switch": "Switch theme"
    }
}
