{
    "HomePage": {
        "title": "Bienvenue sur mon profil",
        "introduction": "Je suis actuellement étudiant en troisième année à <link>Centrale Lyon</link>. Je suis particulièrement passionné par le développement web et je m'intéresse aussi à de nombreux thèmes autour de l'informatique : cybersécurité, analyse de données, visualisation de données...",
        "study": "Mes formations",
        "tools": "Boîte à outils : ",
        "project": "Projets",
        "desc-projects": "Voici quelques projets réalisés pendant mes études et pendant mon temps libre.",
        "projects-link": "{count, plural, =1 {Projet} other {Projets}} en lien : ",
        "other-languages": "Autres languages utilisés : ",
        "commanditaire": "Commanditaire : ",
        "languages": "{count, plural, =1 {Langage utilisé} other {Langages utilisés}} : ",
        "see-more": "Voir plus d'informations",
        "some-lessons": "Quelques cours suivis :",
        "visit-website": "Visiter {count, plural, =1 {le site} other {les sites}} web : ",
        "no-study-found": "Aucune formation trouvée.",
        "no-study-found-desc": "Aucune formation ne m'a enseigné ce langage. Regardez dans les <link>projets</link> pour voir ceux l'utilisant.",
        "creators": "{count, plural, =1 {Co-auteur} other {Co-auteurs}} : ",
        "centrale": {
            "title": "École d'ingénieurs généraliste",
            "description": "Programme généraliste sur les domaines des mathématiques, de la physique, de l'informatique, de la mécanique, de l'électronique, de la gestion de projet et des sciences humaines.",
            "lessons": {
                "Visualisation": {
                    "name": "Visualisation interactive de données",
                    "description": "Apprentissage de techniques de visualisation pour représenter des données (simples, complexes, en grande quantité) de manière interactive et compréhensible."
                },
                "Database": {
                    "name": "Base de données relationnelles",
                    "description": "Étude des concepts de bases de données relationnelles, leur optimisation (formes normales) et leur manipulation via le langage SQL."
                },
                "DataScience": {
                    "name": "Analyse de données",
                    "description": "Introduction aux concepts de l'analyse de données : nettoyage, exploration (clustering), visualisation et modélisation prédictive incluant du machine learning."
                },
                "WebApps": {
                    "name": "Applications Web",
                    "description": "Apprentissage des concepts fondamentaux du développement web et de la relation entre le client et le serveur."
                },
                "CppGui": {
                    "name": "Programmation des interfaces graphiques en C++",
                    "description": "Apprentissage du langage C++ et de la bibliothèque Qt pour le développement d'interfaces graphiques."
                },
                "IA-introduction": {
                    "name": "Apprentissage profond & Intelligence Artificielle : une introduction",
                    "description": "Introduction aux concepts de base de l'intelligence artificielle dont les réseaux de neurones et l'apprentissage profond avec TensorFlow et PyTorch."
                },
                "reseaux": {
                    "name": "Réseaux informatiques",
                    "description": "Étude des principes des 7 couches de la norme OSI, des protocoles réseaux et de la communication entre machines."
                },
                "cybersecu": {
                    "name": "Cybersécurité",
                    "description": "Introduction aux concepts de la cybersécurité, des menaces courantes aux techniques de prévention, défense en passant par les bonnes pratiques de sécurisation des systèmes informatiques."
                },
                "BigData": {
                    "name": "Technologies informatiques du Big Data",
                    "description": "Étude des technologies et outils liés au Big Data pour le traitement de grandes quantités de données."
                }
            }
        },
        "univ": {
            "title": "Master en Technologies de l'Information et du Web",
            "description": "Formation axée sur la science des données, couvrant la visualisation de données, le Big Data, et les techniques d'analyse de données.",
            "lessons": {
                "DataAnalysis": {
                    "name": "Analyse de Données",
                    "description": "Traitements de données complexes à analyser et visualiser en évitant le plus de biais de biais et de pertes possibles. Création d'une interface utilisateur interactive pour visualiser et analyser un grand ensemble de données."
                },
                "BigData": {
                    "name": "Big Data",
                    "description": "Apprentissage de technologies du Big Data, du stockage distribué des données aux frameworks de traitement comme Hadoop et Spark en passant par la lecture et l'écriture de données en continue."
                }
            }
        },
        "fermat": {
            "title": "Classe préparatoire aux grandes écoles - MPSI/XM",
            "description": "Formation intensive en mathématiques, physique et informatique pour préparer les concours d'entrée aux grandes écoles d'ingénieurs.",
            "lessons": {
                "info": {
                    "name": "Informatique",
                    "description": "Introduction aux concepts fondamentaux de l'informatique avec l'apprentissage des principes de l'algorithmique et de la résolution de problèmes."
                },
                "math": {
                    "name": "Mathématiques",
                    "description": "Étude avancée des mathématiques dans de vastes domaines : algèbre linéaire, analyse, topologie..."
                },
                "phy": {
                    "name": "Physique",
                    "description": "Approfondissement des concepts de la physique : mécanique, électricité, optique, mécanique quantique, électromagnétisme."
                }
            }
        },
        "projectsContent": {
            "stage-application": {
                "name": "Application web de collecte de données sportives",
                "description": "Développement d'une application web pour la collecte de données sportives via le traitement d'images et vidéo à des fins de recherche."
            },
            "jeu-inclusif": {
                "name": "Inclusif : le jeu",
                "description": "Développement d'un jeu sérieux visant à sensibiliser les équipes de développement d'interfaces utilisateur autour de l'inclusivité numérique lors de la création, du développement et de la gestion de leurs projets informatiques",
                "paragraph": {
                    "text": "Le projet a été fait dans une équipe de 7 personnes avec une gestion de projet utilisant la méthodologies Scrum. Lors de celui-ci, nous avons appris à utiliser Angular et Figma pour créer des maquettes de l'interface utilisateur. Le projet a été découpé en trois parties :",
                    "li": [
                        "la mise en ligne d'un jeu de société sérieux ;",
                        "un quiz d'inclusivité pour tester ses connaissances dans le domaine ;",
                        "un formulaire d'auto-évaluation d'inclusivité pour vérifier qu'un projet inclut bien dans toutes ses étapes les concepts d'inclusivité numérique."
                    ]
                }
            },
            "challenger": {
                "name": "Le Challenger",
                "description": "Développement de la gestion de permanences pour gérer les bénévoles afinde mettre en place l'un des plus grands événements sportifs étudiants de France."
            },
            "miss-hestia": {
                "name": "Site vitrine - Miss Hestia",
                "description": "Mise en place d'un site vitrine pour mettre en avant les oeuvres d'art d'une artiste."
            },
            "conference": {
                "name": "Système de gestion de conférences",
                "description": "Application web permettant la gestion d'une base (factices) de données de conférences. Le but du projet étant de mettre en place une base de données optimisée, puis de faire des requêtes SQL optimisées pour enfin avoir une interface utilisature simple pour visualiser les données."
            },
            "data-dash": {
                "name": "Visualisation de données du Covid",
                "description": "Interface utilisateur interactive pour visualiser et analyser un grand ensemble de données."
            },
            "moteur-recherche": {
                "name": "Moteur de recherche",
                "description": "Développement d'un moteur de recherche simple en Python en utilisant des techniques de traitement du langage naturel pour rechercher des documents textuels dans une base de données d'études qui nous a été donnée. Ajout d'une solution à partir de graphe de relation entre les documents par les citations effectuées."
            },
            "jeu-dame": {
                "name": "Jeu de Dames",
                "description": "Mise en place d'un jeu de dames en interface web pour apprendre les bases du développement web en JavaScript et la gestion des sockets."
            },
            "2048-qt": {
                "name": "2048",
                "description": "Développement d'un 2048 en C++ avec une interface graphique en utilisant la bibliothèque Qt. Il y a de nombreuses fonctionnalités supplémentaires donc une tentative de création d'un suika."
            },
            "useful-components": {
                "name": "Useful Components",
                "description": "Bibliothèques de composants React simple et réutilisables pour apprendre à la fois le framework React et la création de composants élémentaires."
            },
            "profile": {
                "name": "Portfolio Personnel",
                "description": "Création d'un site web pour faire part de mon profil et de mes projets réalisés. C'est le site web sur lequel vous êtes actuellement."
            }
        }
    },
    "Metadata": {
        "title": "Quentin Potiron - Mon Profil",
        "siteName": "Mon Profile",
        "description": "Site web faisant office de portfolio",
        "keywords": "Portfolio, Profil, Développement Web, Analyse de données, Informatique",
        "locale": "fr_FR"
    },
    "Bar": {
        "alt-profile-picture": "Photo de profil",
        "student": "Étudiant "
    },
    "NotFound": {
        "title": "Page non trouvée",
        "description": "Désolé, la page que vous recherchez n'existe pas ou a été déplacée.",
        "back-home": "Retour à l'accueil"
    },
    "ErrorPage": {
        "title": "Oups ! Une erreur est survenue",
        "description": "Il semble y avoir un problème avec votre demande.",
        "retry": "Réessayer",
        "back-to-home": "Retourner à l'accueil"
    },
    "DefaultTexts": {
        "selectAnOption": "Sélectionnez une option",
        "select": "Sélectionner un ou des langages de programmation",
        "search": "Rechercher...",
        "all": "Tous",
        "clear": "Effacer",
        "close": "Fermer",
        "more": "{count, plural, =1 {option} other {options}}",
        "clear-all": "Effacer toutes les sélections",
        "aria-search": "Champ de recherche",
        "dropdown-explain": "Sélecteur déroulant à plusieurs choix. Utilisez les flèches haut et bas pour naviguer, la barre d'espace pour sélectionner ou désélectionner une option, et la touche Échap pour fermer le sélecteur.",
        "filter-explain": "Ecrivez pour filtrer les options disponibles. Utilisez les flèches haut et bas pour naviguer dans les options filtrées."
    },
    "Footer": {
        "copyright": "© 2026 Mon Profil. Tous droits réservés.",
        "contact-me": "Contact : "
    },
    "Header": {
        "home": "Accueil",
        "study": "Études",
        "project": "Projets",
        "alt-logo": "Logo du site"
    },
    "StudyPage": {
        "title": "Mes formations"
    },
    "ProjectPage": {
        "title": "Mes Projets",
        "order-by": "Trier par : ",
        "default": "Par défaut",
        "date": "Date",
        "lexicographical": "Alphabétique",
        "introduction": "Vous trouverez la liste de mes projets réalisés ou encore en cours ci-dessous. Certains projets sont réalisés dans le cadre de mes études, d'autres ont été fait purement pour le plaisir.",
        "large-projects": "Projets majeurs",
        "little-projects": "Autres projets",
        "no-project-found": "Aucun projet trouvé.",
        "no-project-found-desc": "Aucun projet n'a été réalisé avec ce langage ou cet outil."
    },
    "ThemeSwitch": {
        "switch": "Changer le thème"
    }
}
